export const FAQs: Record<'answer' | 'question', string>[] = [
  {
    question: 'Что такое логин Steam?',
    answer: `
      <p>Логин Steam - это то, что вы указываете, когда заходите в стим ( Не ваш никнейм )! Вам необходимо указать именно логин! Он находится во вкладке об аккаунте, как указано на скриншоте ниже.</p>
      <img src="/where_is_login.jpg" />
    `,
  },
  {
    question: 'В течении какого времени придут деньги после оплаты?',
    answer: `
      <p>Средства будут зачислены на ваш счет немедленно после завершения платежа. В редких случаях могут возникнуть небольшие задержки, которые обычно не превышают нескольких минут.</p>
      <p>Если же задержка окажется длительной, пожалуйста, свяжитесь с нашей <a href="">Технической поддержкой</a> для выяснения обстоятельств.</p>
    `,
  },
  {
    question: 'Какие аккаунты Steam и из каких стран можно пополнить?',
    answer: '<p>На данный момент вы можете пополнить все аккаунты Steam из РФ, кроме регионов Крыма, Луганска и Донецка. Над пополнением аккаунтов из других регионов  СНГ мы работаем.</p>',
  },
  {
    question: 'Как пополнить Steam аккаунт, которые до этого не пополняли?',
    answer: `
      <p>Для того чтобы сохранить текущий регион на вашем аккаунте Steam при первом пополнении, важно следовать этим рекомендациям:</p>
      <ol>
        <li>Добавление бесплатных игр в библиотеку: Включите несколько бесплатных игр, таких как Dota 2, CS или PUBG, если они доступны в вашем регионе.<br/>Это поможет укрепить привязку вашего аккаунта к текущему региону и сделать процесс пополнения более безопасным и прозрачным.</li>
        <li>Игра без использования маскировки: Запускайте эти игры без применения программ или приложений, которые могут скрывать ваше местоположение.<br/>Это позволит избежать конфликтов с определением вашего региона и сохранить его стабильным.</li>
      </ol>
      <p>Эти простые меры помогут предотвратить нежелательные изменения региона на вашем аккаунте Steam и обеспечить беспроблемное использование платформы.</p>
    `,
  },
  {
    question: 'TODO Как получить квитанцию об оплате?',
    answer: 'There is no answer :(',
  },
  {
    question: 'TODO Что такое промокод?',
    answer: '<p>На данный момент эта возможность находится в разработке, в дальнейшем промокоды можно будет использовать для снижения комиссии, а найти их можно будет в телеграм канале: <a href="">DotaFun</a>.</p>',
  },
  {
    question: 'Средства не дошли?',
    answer: `
      <p>При пополнении вашего баланса денежные средства проходят через сложную цепочку наших партнеров. Не исключаем, что могла возникнуть техническая заминка на стороне одного из провайдеров платежей.</p>
      <p>Если же задержка окажется длительной более 30 минут, пожалуйста, свяжитесь с нашей <a href="">Технической поддержкой</a> для выяснения обстоятельств.</p>
    `,
  },
  {
    question: 'Лимиты и ограничения',
    answer: 'У нас присутствуют ограничения на минимальные суммы для всех способов зачисления. Если вы пополняете аккаунт более чем на 10.000 рублей за 24 часа, часть средств может сразу не дойти.',
  },
  {
    question: 'Остались вопросы?',
    answer: 'Если у вас возникли дополнительные вопросы, пожалуйста, свяжитесь с нашей <a href="">Технической поддержкой</a> для выяснения обстоятельств.',
  },
]
