<template>
 <section class="faq">
  <h2 class="faq__title">Вопросы и ответы</h2>
  <ElCollapse 
    v-model="activeFAQ"
    accordion
    class="faq__list"
  >
    <ElCollapseItem 
      v-for="(item, index) in FAQs"
      :key="index"
      :name="index"
      :title="item.question"
    >
      <p>{{ item.answer }}</p>
    </ElCollapseItem>
  </ElCollapse>
 </section>
</template>

<script setup lang="ts">
import { ref } from 'vue'

const FAQs: Record<'answer' | 'question', string>[] = [
  {
    question: 'Как работает сервис?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Требования к аккаунтам и какие аккаунты нельзя пополнять?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Что такое логин Steam?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Как пополнить Steam?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Какие аккаунты Steam и из каких стран можно пополнить?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Как пополнить новый аккаунт Steam?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Как избежать изменения региона на аккаунте Steam при первом пополнении?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Как получить квитанцию об оплате?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Что такое промокод?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Средства не дошли?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Лимиты и ограничения',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  },
  {
    question: 'Остались вопросы?',
    answer: 'Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.Тут какой-то текст описания. Тут какой-то текст описания. Тут какой-то текст описания.Тут какой-то текст описания.'
  }
]

const activeFAQ = ref('1')
</script>

<style lang="scss" scoped>
.faq {
  &__title {
    font-size: 36px;
    font-weight: 700;
    line-height: 1.25em;
    text-align: center;
  }
  &__list {
    margin-top: 30px;

    & > div:not(:first-child) {
      margin-top: 10px;
    }

    & > * p {
      line-height: 1.25em;
    }
  }
}
</style>